package chap02;

public class Chap02Study {

}

/*
コレクションの種類
|種類        |概要                                            |
|リスト(List)|順序をつけてデータを格納する                    |
|セット(Set) |重複を許さない、数字における集合                |
|マップ(Map) |「キー」と「値」のペアでデータを関連して格納する|

Listインターフェースの実装クラス
|実装      |概要                                                                                                                                      |
|ArrayList |要素を配列で保持しているため要素の検索は高速に処理できるが、要素数が多くなると追加や削除処理に時間がかかる                                |
|LinkedList|要素同士を前後双方向のリンクで参照するリスト構造を用いて管理している。要素の検索などインデックス値によるランダムなアクセスには不向きである|
*/